app/views/pages/_form.html.erb

SELECT "pages".* FROM "pages"
---
      <%= f.label :page_type, "Page Type" %>
      <%= f.select :page_type, Page::PAGETYPES, {}, :class => 'form-control', :onchange => 'onChangeType(this)' %>