app/views/posts/_form.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."page_type" = 3 LIMIT 1
---
    <%= f.label :page_path %><br />
    <%= f.collection_select(:page_path, Page.where('pages.page_type IN (?, ?)',
      Page::PAGETYPES[:BLOG], Page::PAGETYPES[:GALLERY]), :path, :path) %>