app/controllers/pages_controller.rb

  def create
    # Create page and set path based on title
    @page = Page.new(page_params)
    @page.path = @page.title.downcase.gsub(/\s+/, '')

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("content", "created_at", "page_type", "path", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", ""], ["created_at", Sat, 16 Feb 2013 22:36:58 UTC +00:00], ["page_type", 3], ["path", "blog"], ["title", "blog"], ["updated_at", Sat, 16 Feb 2013 22:36:58 UTC +00:00]]

  def update
    page = Page.find_by_path(params[:page][:path])
    respond_to do |format|
      if page.update_attributes(page_params)
---
SELECT "pages".* FROM "pages" WHERE "pages"."path" = 'home' LIMIT 1
UPDATE "pages" SET "content" = 'Welcome home! Yay!', "updated_at" = '2013-02-09 21:23:23.727408' WHERE "pages"."id" = 1

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = ?  [["id", 6]]

  def load_page
    # Redirects to admin page if no admin pass
    if !Settings.instance.admin_pass
      redirect_to :admin
    # Redirects to new page if no pages
    elsif !Page.any?
      redirect_to :pages_new
    else
      path = params[:path]
      @page = Page.find_by_path(path)
---
SELECT "pages".* FROM "pages"
SELECT "pages".* FROM "pages" WHERE "pages"."path" = 'home' LIMIT 1

  def load_posts_alpha
    if Post.count > 0
---
SELECT "posts".* FROM "posts" WHERE (posts.page_path='blog') ORDER BY created_at DESC