app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_page
    if params[:path]
      @page = Page.find_by_path!(params[:path])
    elsif params[:id]
      @page = Page.find_by_id!(params[:id])